In [1]:
import pandas as pd
from sqlalchemy import create_engine # bikin connection antara code dengan db
from sqlalchemy import text

In [2]:
# create engine for postgresql connection

db_user = 'postgres'
db_pass = 'admin'
db_location = 'localhost'
db_port = '5432'
db_name = 'latihan_binar'
# template -> create_engine('postgresql://user_id:pass@location:port/database_name')
engine = create_engine(f'postgresql://{db_user}:{db_pass}@{db_location}:{db_port}/{db_name}') #f string format

# connect to db
connection = engine.connect()

## 1. Data enrichment

In [15]:
q = """
    
    """
result = connection.execute(text(q))
df = pd.DataFrame(result)

In [3]:
# unique id for women_clothing_ecommerce
df_ecommerce = pd.read_csv('../dataset/ecommerce_women_clothing.csv')

In [4]:
df_ecommerce.head()

,order_id,order_date,sku,color,size,unitPrice,quantity,REVENUE,temp_value
0,1,2022/6/1 16:05:00,708,Dark Blue,2XL,298,1,298,144713.6701388889708Dark Blue2XL2981298
1,1,2022/6/1 16:05:00,89,Dark Blue,2XL,258,1,258,144713.670138888989Dark Blue2XL2581258
2,2,2022/6/10 17:03:00,bobo,Cream,One Size,228,1,228,244722.7104166667boboCreamOne Size2281228
3,3,2022/6/10 19:59:00,799,Dark Blue,XL,264,1,264,344722.8326388889799Dark BlueXL2641264
4,4,2022/6/11 11:42:00,799,Dark Blue,M,264,1,264,444723.4875799Dark BlueM2641264

- cek apakah table memiliki primary key dengan cara menghitung frequensi kemunculan terduga primary_key

In [8]:
# menghitug kemunculan value pada 1 kolom
df_ecommerce['order_id'].value_counts()

order_id
134    13
204     7
62      6
18      6
73      6
       ..
208     1
207     1
206     1
205     1
273     1
Name: count, Length: 273, dtype: int64

In [10]:
df_ecommerce[df_ecommerce.duplicated()]

,order_id,order_date,sku,color,size,unitPrice,quantity,REVENUE,temp_value
396,201,2022/8/15 12:38:00,799,Dark Blue,XL,266,1,266,20144788.5263888889799Dark BlueXL2661266

duplikasi terjadi pada order_id = 201

In [11]:
df_ecommerce[df_ecommerce['order_id'].duplicated()]

,order_id,order_date,sku,color,size,unitPrice,quantity,REVENUE,temp_value
1,1,2022/6/1 16:05:00,89,Dark Blue,2XL,258,1,258,144713.670138888989Dark Blue2XL2581258
16,15,2022/6/14 14:38:00,bobo,Blue,One Size,228,1,228,1544726.6097222222boboBlueOne Size2281228
17,15,2022/6/14 14:38:00,bobo,Light Gray,One Size,228,1,228,1544726.6097222222boboLight GrayOne Size2281228
21,18,2022/6/15 13:36:00,77,C,NaN,258,1,258,1844727.566666666777C2581258
22,18,2022/6/15 13:36:00,77,D,NaN,258,1,258,1844727.566666666777D2581258
...,...,...,...,...,...,...,...,...,...
523,171,2022/9/9 6:27:00,799,Dark Blue,M,265,1,265,17144813.26875799Dark BlueM2651265
524,172,2022/9/9 7:18:00,708,Dark Blue,4XL,278,1,278,17244813.3041666667708Dark Blue4XL2781278
525,173,2022/9/9 7:22:00,799,Dark Blue,M,265,1,265,17344813.3069444444799Dark BlueM2651265
526,174,2022/9/9 8:25:00,799,Dark Blue,L,265,1,265,17444813.3506944444799Dark BlueL2651265
527,175,2022/9/9 9:47:00,799,Dark Blue,XL,265,1,265,17544813.4076388889799Dark BlueXL2651265

Table tidak memiliki  primary key -> handling -> create surrogate_key \
surrogate_key = primary_key buatan untuk data model 

cara
1. buat sebuah kolom baru yang merupakan gabungan dari kolom2 lain hingga value unik
2. buat hashing terhadap value yang dibuat -> ini jadi poin 4

In [15]:
# membuat kolom menjadi string
# template -> nama_var['column'].map(str)
df_ecommerce['primary_key'] = df_ecommerce['order_id'].map(str) + '_' + df_ecommerce['sku'].map(str) + '_' + df_ecommerce['color'].map(str)

In [16]:
# checking new surrogate key using uniquness check
df_ecommerce['primary_key'].value_counts()

primary_key
134_79_Light Blue         6
134_3799_Grey Wash        3
134_218_Black             3
137_799_Dark Blue         3
83_799_Dark Blue          3
                         ..
164_9699_Light Blue       1
161_1719_Black Stripes    1
160_799_Dark Blue         1
160_61399_Mid Wash        1
174_799_Dark Blue         1
Name: count, Length: 440, dtype: int64

In [19]:
df_ecommerce['primary_key'] = df_ecommerce['order_id'].map(str) + '_' + \
                              df_ecommerce['sku'].map(str) + '_' + \
                              df_ecommerce['color'].map(str) + '_' + \
                              df_ecommerce['quantity'].map(str) + '_' + \
                              df_ecommerce['REVENUE'].map(str)

In [20]:
# checking new surrogate key using uniquness check
df_ecommerce['primary_key'].value_counts()

primary_key
134_79_Light Blue_1_315     6
134_218_Black_1_318         3
134_3799_Grey Wash_1_268    3
147_799_Dark Blue_1_288     2
94_708_Dark Blue_1_298      2
                           ..
152_799_Dark Blue_1_266     1
151_799_Dark Blue_1_266     1
150_799_Dark Blue_1_266     1
148_799_Dark Blue_1_266     1
175_799_Dark Blue_1_265     1
Name: count, Length: 491, dtype: int64

In [5]:
# mendapatkan surrogate key baru dengan menggabungkan value dari semua kolom
df_ecommerce['primary_key'] = df_ecommerce['order_id'].map(str) + '_' + \
                              df_ecommerce['order_date'].map(str) + '_' + \
                              df_ecommerce['sku'].map(str) + '_' + \
                              df_ecommerce['size'].map(str) + '_' + \
                              df_ecommerce['color'].map(str) + '_' + \
                              df_ecommerce['quantity'].map(str) + '_' + \
                              df_ecommerce['unitPrice'].map(str) + '_' + \
                              df_ecommerce['REVENUE'].map(str)

In [29]:
df_ecommerce['primary_key'].value_counts()

primary_key
201_2022/8/15 12:38:00_799_XL_Dark Blue_1_266_266    2
25_2022/8/8 15:11:00_239_nan_Navy Blue_1_239_239     1
37_2022/8/9 16:27:00_799_XL_Dark Blue_1_266_266      1
36_2022/8/9 13:27:00_218_M_Black_1_296_296           1
35_2022/8/9 13:03:00_799_L_Dark Blue_1_266_266       1
                                                    ..
147_2022/7/3 6:48:00_1499_XL_Light Blue_1_287_287    1
146_2022/7/3 21:14:00_799_M_Dark Blue_1_288_288      1
146_2022/7/3 21:14:00_2499_M_Dark Wash_1_249_249     1
145_2022/7/3 15:41:00_708_XL_Dark Blue_1_298_298     1
175_2022/9/9 9:47:00_799_XL_Dark Blue_1_265_265      1
Name: count, Length: 527, dtype: int64

In [28]:
# checking new surrogate key using uniquness check
df_ecommerce[df_ecommerce['primary_key'].duplicated()]

,order_id,order_date,sku,color,size,unitPrice,quantity,REVENUE,temp_value,primary_key
396,201,2022/8/15 12:38:00,799,Dark Blue,XL,266,1,266,20144788.5263888889799Dark BlueXL2661266,201_2022/8/15 12:38:00_799_XL_Dark Blue_1_266_266

new surrogate_key dapat dibuat dengan menggabungkan semua kolom pada table

In [15]:
# create query
q = """
    select *
    from mp_dataset.order_details
    """
# running query
result = connection.execute(text(q))

# casting query result into pandas dataframe
df_order_details = pd.DataFrame(result)

In [16]:
df_order_details.head()

   order_id  product_id  quantity discount
0     10248          11        12        0
1     10248          42        10        0
2     10248          72         5        0
3     10249          14         9        0
4     10249          51        40        0

#### Exercise
Buat unique id / primary key / surrogate key untuk fact table order details.

In [17]:
df_order_details['new_key'] = df_order_details['order_id'].map(str) + \
                              '_' + df_order_details['product_id'].map(str)
df_order_details['new_key'].value_counts()

new_key
10248_11    1
10459_72    1
10470_64    1
10471_7     1
10471_56    1
           ..
10361_39    1
10361_60    1
10362_25    1
10362_51    1
10585_47    1
Name: count, Length: 900, dtype: int64

In [29]:
# copy df ke df baru
fact_order_details = df_order_details.copy()

In [19]:
fact_order_details.head()

   order_id  product_id  quantity discount   new_key
0     10248          11        12        0  10248_11
1     10248          42        10        0  10248_42
2     10248          72         5        0  10248_72
3     10249          14         9        0  10249_14
4     10249          51        40        0  10249_51

In [5]:
# order date to shipped_date
# create query
q = """
    select *
    from mp_dataset.orders
    """
# running query
result = connection.execute(text(q))

# casting query result into pandas dataframe
df_orders = pd.DataFrame(result)

In [42]:
q = """
    select *
    from mp_dataset.orders
    """
# running query
result = connection.execute(text(q))

# casting query result into pandas dataframe
df_orders = pd.DataFrame(result).head()

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium

In [6]:
df_orders['delta_order_to_shipped'] = pd.to_timedelta(df_orders['shipped_date'] - df_orders['order_date']).dt.days

In [7]:
fact_orders = df_orders.copy()

In [11]:
fact_orders.to_sql( 
                    'fact_orders', 
                    con=engine,
                    schema='dim_fact_layer',
                    if_exists='replace',
                    index=False,
                    method='multi'
                  )

653

## 2. Mapping

- Mapping -> join (sql) \
pandas -> df1.merge(df2, how = "cara_join", on='kolom_join')

In [21]:
# check fact table order details
fact_order_details.head()

   order_id  product_id  quantity discount   new_key
0     10248          11        12        0  10248_11
1     10248          42        10        0  10248_42
2     10248          72         5        0  10248_72
3     10249          14         9        0  10249_14
4     10249          51        40        0  10249_51

In [22]:
q = """
    select *
    from mp_dataset.products
    """
# running query
result = connection.execute(text(q))
# casting query result into pandas dataframe
df_product = pd.DataFrame(result)

In [24]:
df_product.head()

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Antons Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Antons Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1

In [30]:
# mapping harga produk dan unit pada fact table order details dari dimension products (enrich discount)
fact_order_details = fact_order_details.merge(df_product, how='inner', on='product_id' )
# fact_order_details = fact_order_details.merge(df_product, how='inner', left_on='product_id' , right_on="product_id")
fact_order_details = fact_order_details[['new_key','order_id', 'product_id', 'quantity', 'discount', 'unit_price']]

In [32]:
# check
fact_order_details.head()

    new_key  order_id  product_id  quantity discount unit_price
0  10248_11     10248          11        12        0      21.00
1  10296_11     10296          11        12        0      21.00
2  10327_11     10327          11        50      0.2      21.00
3  10353_11     10353          11        12      0.2      21.00
4  10365_11     10365          11        24        0      21.00

In [34]:
# buat kolom subtotal dengan formula quantity x unit_price
fact_order_details['subtotal'] = fact_order_details['quantity'] * fact_order_details['unit_price']

In [35]:
fact_order_details.head()

    new_key  order_id  product_id  quantity discount unit_price subtotal
0  10248_11     10248          11        12        0      21.00   252.00
1  10296_11     10296          11        12        0      21.00   252.00
2  10327_11     10327          11        50      0.2      21.00  1050.00
3  10353_11     10353          11        12      0.2      21.00   252.00
4  10365_11     10365          11        24        0      21.00   504.00

In [36]:
# mapping products and category, add category_name and category_description
q = """
    select *
    from mp_dataset.categories
    """
# running query
result = connection.execute(text(q))
# casting query result into pandas dataframe
df_category = pd.DataFrame(result)

In [74]:
# join product and category on category
dim_product = df_product.merge(df_category, how = 'inner', on = 'category_id')

In [75]:
# rename kolom description menjadi category_description
dim_product.rename({'description':'category_description'}, axis = 1, inplace=True)

In [44]:
# load data to layer 2
# template
# nama_var.to_sql('nama_table_tujuan', c
#                  on=engine, 
                #  schema='nama_schema',
#                  if_exists='replace',
                #  index=False,
                #  method='multi'
                # )

dim_product.to_sql( 
                    'dim_products', 
                    con=engine,
                    schema='dim_fact_layer',
                    if_exists='replace',
                    index=False,
                    method='multi'
                  )

77

#### Exercise
1. Lengkapi table order dengan **employee_name** dari tabel `employee`. 
2. **employee_name** merupakan gabungan dari kolom `first_name` dan `last_name`
3. Kemudian simpan hasil pengolahan ke `dim_fact_layer`

## 3.Parsing

In [48]:
# first name dari customer
q = """
    select *
    from mp_dataset.customers
    """
# running query
result = connection.execute(text(q))
# casting query result into pandas dataframe
df_customer = pd.DataFrame(result)

In [49]:
df_customer.head()

,customer_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,Western Europe,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,Central America,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,Central America,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,British Isles,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,Northern Europe,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [55]:
# parsing
# template 
# nama_var['column'].str.split('delimiter', expand = True/False)
df_customer['first_name'] = df_customer['contact_name'].str.split(' ', expand = True)[0]

In [56]:
df_customer.head()

,customer_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax,first_name
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,Western Europe,12209,Germany,030-0074321,030-0076545,Maria
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,Central America,05021,Mexico,(5) 555-4729,(5) 555-3745,Ana
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,Central America,05023,Mexico,(5) 555-3932,None,Antonio
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,British Isles,WA1 1DP,UK,(171) 555-7788,(171) 555-6750,Thomas
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,Northern Europe,S-958 22,Sweden,0921-12 34 65,0921-12 34 67,Christina

In [57]:
dim_customer = df_customer.copy()

In [58]:
dim_customer.to_sql( 
                    'dim_customer', 
                    con=engine,
                    schema='dim_fact_layer',
                    if_exists='replace',
                    index=False,
                    method='multi'
                  )

91

#### Exercise
1. Buat kolom turunan dari **quantity_per_unit** pada dimension table `products` yaitu **quantity_in_package** dan **unit_package_size**. \
    Note : 
    - **quantity_in_package** : total jumlah kemasan dalam 1 unit. contoh **quantity_per_unit** = 24 - 12 oz bottles, maka **quantity_in_package** = 24
    - **unit_package_size** : ukuran kemasan terkecil dari unit barang. contoh **quantity_per_unit** = 24 - 12 oz bottles, maka **unit_package_size** = 12 oz bottles
2. Simpan hasil pengolahan ke `dim_fact_layer`

In [77]:
df_product.head(20)

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Antons Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Antons Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1
5,6,Grandmas Boysenberry Spread,3,2,12 - 8 oz jars,25.00,120,0,25,0
6,7,Uncle Bobs Organic Dried Pears,3,7,12 - 1 lb pkgs.,30.00,15,0,10,0
7,8,Northwoods Cranberry Sauce,3,2,12 - 12 oz jars,40.00,6,0,0,0
8,9,Mishi Kobe Niku,4,6,18 - 500 g pkgs.,97.00,29,0,0,1
9,10,Ikura,4,8,12 - 200 ml jars,31.00,31,0,0,0
10,11,Queso Cabrales,5,4,1 kg pkg.,21.00,22,30,30,0
11,12,Queso Manchego La Pastora,5,4,10 - 500 g pkgs.,38.00,86,0,0,0
12,13,Konbu,6,8,2 kg box,6.00,24,0,5,0
13,14,Tofu,6,7,40 - 100 g pkgs.,23.25,35,0,0,0
14,15,Genen Shouyu,6,2,24 - 250 ml bottles,15.50,39,0,5,0
15,16,Pavlova,7,3,32 - 500 g boxes,17.45,29,0,10,0
16,17,Alice Mutton,7,6,20 - 1 kg tins,39.00,0,0,0,1
17,18,Carnarvon Tigers,7,8,16 kg pkg.,62.50,42,0,0,0
18,19,Teatime Chocolate Biscuits,8,3,10 boxes x 12 pieces,9.20,25,0,5,0
19,20,Sir Rodneys Marmalade,8,3,30 gift boxes,81.00,40,0,0,0

In [83]:
# replace ' x ' into ' - ' supaya seragam formatnya
df_product['quantity_per_unit'] =  df_product['quantity_per_unit'].str.replace(' x ',' - ')

In [85]:
# parsing by ' - '
temp = df_product['quantity_per_unit'].str.split(' - ', expand = True).head(20)

In [86]:
# membuat kolom baru dari hasil parsing
df_product['quantity_in_package'] = temp[0]
df_product['unit_package_size'] = temp[1]

In [87]:
df_product.head(20)

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued,quantity_in_package,unit_package_size
0,1,Chai,1,1,10 boxes - 20 bags,18.00,39,0,10,0,10 boxes,20 bags
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0,24,12 oz bottles
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0,12,550 ml bottles
3,4,Chef Antons Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0,48,6 oz jars
4,5,Chef Antons Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1,36 boxes,None
5,6,Grandmas Boysenberry Spread,3,2,12 - 8 oz jars,25.00,120,0,25,0,12,8 oz jars
6,7,Uncle Bobs Organic Dried Pears,3,7,12 - 1 lb pkgs.,30.00,15,0,10,0,12,1 lb pkgs.
7,8,Northwoods Cranberry Sauce,3,2,12 - 12 oz jars,40.00,6,0,0,0,12,12 oz jars
8,9,Mishi Kobe Niku,4,6,18 - 500 g pkgs.,97.00,29,0,0,1,18,500 g pkgs.
9,10,Ikura,4,8,12 - 200 ml jars,31.00,31,0,0,0,12,200 ml jars
10,11,Queso Cabrales,5,4,1 kg pkg.,21.00,22,30,30,0,1 kg pkg.,None
11,12,Queso Manchego La Pastora,5,4,10 - 500 g pkgs.,38.00,86,0,0,0,10,500 g pkgs.
12,13,Konbu,6,8,2 kg box,6.00,24,0,5,0,2 kg box,None
13,14,Tofu,6,7,40 - 100 g pkgs.,23.25,35,0,0,0,40,100 g pkgs.
14,15,Genen Shouyu,6,2,24 - 250 ml bottles,15.50,39,0,5,0,24,250 ml bottles
15,16,Pavlova,7,3,32 - 500 g boxes,17.45,29,0,10,0,32,500 g boxes
16,17,Alice Mutton,7,6,20 - 1 kg tins,39.00,0,0,0,1,20,1 kg tins
17,18,Carnarvon Tigers,7,8,16 kg pkg.,62.50,42,0,0,0,16 kg pkg.,None
18,19,Teatime Chocolate Biscuits,8,3,10 boxes - 12 pieces,9.20,25,0,5,0,10 boxes,12 pieces
19,20,Sir Rodneys Marmalade,8,3,30 gift boxes,81.00,40,0,0,0,30 gift boxes,None

## 4. Encryption and anonymisation

In [7]:
df_ecommerce['primary_key']

0        1_2022/6/1 16:05:00_708_2XL_Dark Blue_1_298_298
1         1_2022/6/1 16:05:00_89_2XL_Dark Blue_1_258_258
2      2_2022/6/10 17:03:00_bobo_One Size_Cream_1_228...
3        3_2022/6/10 19:59:00_799_XL_Dark Blue_1_264_264
4         4_2022/6/11 11:42:00_799_M_Dark Blue_1_264_264
                             ...
523       171_2022/9/9 6:27:00_799_M_Dark Blue_1_265_265
524     172_2022/9/9 7:18:00_708_4XL_Dark Blue_1_278_278
525       173_2022/9/9 7:22:00_799_M_Dark Blue_1_265_265
526       174_2022/9/9 8:25:00_799_L_Dark Blue_1_265_265
527      175_2022/9/9 9:47:00_799_XL_Dark Blue_1_265_265
Name: primary_key, Length: 528, dtype: object

In [8]:
# hashing women_clothing_ecommerce
import hashlib

# Function to 'reverse' the hash
# Function to hash a value using MD5
def hash_md5(val):
    return hashlib.md5(val.encode()).hexdigest()

# Apply the reverse function
# template df['kolom'].apply(nama_fungsi)
df_ecommerce['primary_key'] = df_ecommerce['primary_key'].map(str).apply(hash_md5)

In [9]:
df_ecommerce.head()

,order_id,order_date,sku,color,size,unitPrice,quantity,REVENUE,temp_value,primary_key
0,1,2022/6/1 16:05:00,708,Dark Blue,2XL,298,1,298,144713.6701388889708Dark Blue2XL2981298,4435005269b30837895296d1526c058b
1,1,2022/6/1 16:05:00,89,Dark Blue,2XL,258,1,258,144713.670138888989Dark Blue2XL2581258,c4356b9f5cfc3745fae97c33e740a0ed
2,2,2022/6/10 17:03:00,bobo,Cream,One Size,228,1,228,244722.7104166667boboCreamOne Size2281228,64b35376a86cbf5e7df313001455b81f
3,3,2022/6/10 19:59:00,799,Dark Blue,XL,264,1,264,344722.8326388889799Dark BlueXL2641264,2bfd4700d2655d26e22ad28c63925fb1
4,4,2022/6/11 11:42:00,799,Dark Blue,M,264,1,264,444723.4875799Dark BlueM2641264,b769b4898181ad7cf69a39319f57b266

In [13]:
# define extraction process from postgresql

def extract_from_postgres(query):
    # fungsi : meng-ekstraksi data dari postgresql dengan query yang diinput
    # input : 
    #   query : sql query untuk mengambil data
    # output :
    #   df_temp : pandas dataframe dari query yang diinput 

    # running query
    result = connection.execute(text(query))

    # casting query result into pandas dataframe
    df_temp = pd.DataFrame(result)

    return df_temp

# create query
q = """
    select *
    from mp_dataset.order_details
    """

df_order_details = extract_from_postgres(q)
df_order_details.head()

   order_id  product_id  quantity discount
0     10248          11        12        0
1     10248          42        10        0
2     10248          72         5        0
3     10249          14         9        0
4     10249          51        40        0

In [14]:
# create new column to get surrogate key
df_order_details['order_detail_id'] = df_order_details['order_id'].map(str) + '_' + df_order_details['product_id'].map(str)

In [16]:
# checking result
df_order_details['order_detail_id'].value_counts()

order_detail_id
10248_11    1
10459_72    1
10470_64    1
10471_7     1
10471_56    1
           ..
10361_39    1
10361_60    1
10362_25    1
10362_51    1
10585_47    1
Name: count, Length: 900, dtype: int64

In [ ]:
df_order_details.to_sql( 
                            'fact_order_details', 
                            con=engine,
                            schema='dim_fact_layer',
                            if_exists='replace',
                            index=False,
                            method='multi'
                        )

#### Exercise
1. Buat Hashing untuk value di order_detail_id pada fact table `order_details` menggunakan MD5
2. Simpan hasil pengolahan ke `dim_fact_layer`

In [17]:
import hashlib
def hash_md5(val):
    return hashlib.md5(val.encode()).hexdigest()
df_order_details['order_detail_id'] = df_order_details['order_detail_id'].map(str).apply(hash_md5)

## 5.Rename

In [3]:
# define extraction process from postgresql

def extract_from_postgres(query):
    # fungsi : meng-ekstraksi data dari postgresql dengan query yang diinput
    # input : 
    #   query : sql query untuk mengambil data
    # output :
    #   df_temp : pandas dataframe dari query yang diinput 

    # running query
    result = connection.execute(text(query))

    # casting query result into pandas dataframe
    df_temp = pd.DataFrame(result)

    return df_temp

# create query
q = """
    select *
    from mp_dataset.shippers
    """

df_shipper = extract_from_postgres(q)
df_shipper.head()

   id      company_name           phone
0   1    Speedy Express  (503) 555-9831
1   2    United Package  (503) 555-3199
2   3  Federal Shipping  (503) 555-9931

findings:
1. penamaan kolom hanya id, perlu penamaan yang lebih deskriptif. Contoh shipper_id
2. pada kolom phone, ada simbol yang dikhawatirkan membuat data kurang maksimal digunakan yaitu( )

In [4]:
# change id in shippers dimension tables
# rename column template
# nama_var.rename(columns={'value_awal':'value_akhir'})
df_shipper.rename(columns={'id':'shipper_id'})

   shipper_id      company_name           phone
0           1    Speedy Express  (503) 555-9831
1           2    United Package  (503) 555-3199
2           3  Federal Shipping  (503) 555-9931

In [25]:
df_shipper.rename(columns={'id':'shipper_id'}, inplace = True)

In [5]:
# check detail kolom phone
df_shipper['phone'].value_counts()

phone
(503) 555-9831    1
(503) 555-3199    1
(503) 555-9931    1
Name: count, dtype: int64

In [16]:
# hilangkan tanda ( ) di kolom phone
# mengganti/replace value dalam sebuah kolom
# template -> nama_var['column'].str.replace('value_awal', 'value_akhir')
# Note : proses replace bisa digabung dalam 1 line

# menghilangkan `(`` dari phone kolom, dan mengganti `) ` dengan `-`
df_shipper['phone'] = df_shipper['phone'].str.replace('(', '').str.replace(') ', '-')

In [17]:
# check result
df_shipper.head()

   id      company_name         phone
0   1    Speedy Express  503-555-9831
1   2    United Package  503-555-3199
2   3  Federal Shipping  503-555-9931

In [18]:
# change null value in dimension tables categories
q="""
    select *
    from mp_dataset.categories
  """
df_category = extract_from_postgres(q)
df_category.head()

,category_id,category_name,description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"

In [19]:
df_category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    9 non-null      int64
 1   category_name  8 non-null      object
 2   description    9 non-null      object
dtypes: int64(1), object(2)
memory usage: 344.0+ bytes

In [20]:
df_category

,category_id,category_name,description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish
8,9,None,ligh meals and snack

data yang null , ada 2 opsi pengisian
1. diisi sama value yang ga mungkin ada , contoh "unknown category"
2. diisi dengan value yang make sense TAPI infokan tim biz dan eng terkait vaiue yang dibuat

In [23]:
# mengisi value yang null di kolom
# template -> nama_variable_df['column'].fillna('value_seharusnya')
df_category['category_name'] = df_category['category_name'].fillna('Snacks')

In [24]:
df_category

,category_id,category_name,description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish
8,9,Snacks,ligh meals and snack

#### Exercise
1. Ganti nama surrogate key yang dibuat pada fact table `order_details` menjadi **detail_order_id**
2. Simpan hasil pengolahan ke `dim_fact_layer`
3. dibuat di notebook baru, full dari extraction, create surrogate key, hashing, rename, load ke postgres

## 6. Filtering, Aggregation, and Summary

In [26]:
# melakukan aggregate / grouping pandas
# template -> nama_var[['col1', 'col2', ...]].groupby(['colom_aggregasi']).function()
# function bisa milih : sum, median, mean, std, min, max, nunique, count

# sql
# select date(order_date) as order_date,
    #    count(distinct order_id)
# from table
# group by date(order_date)  
# -> column_aggregsi = date(order_date)

In [ ]:
# melengkapi revenue dan quantity per order pada fact table orders

In [27]:
# extract data orders
# create query
q = """
    select *
    from mp_dataset.orders
    """

df_order = extract_from_postgres(q)
df_order.head()

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium

In [29]:
# extract order details
q = """
    select *
    from mp_dataset.order_details
    """

df_order_detail = extract_from_postgres(q)


# extract products
q = """
    select *
    from mp_dataset.products
    """

df_product = extract_from_postgres(q)

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Antons Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Antons Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1

In [30]:
df_order_detail.head()

   order_id  product_id  quantity discount
0     10248          11        12        0
1     10248          42        10        0
2     10248          72         5        0
3     10249          14         9        0
4     10249          51        40        0

In [31]:
df_product.head()

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Antons Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Antons Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1

In [34]:
# proses join di pandas
# template -> df1.merge(df2, on="nama_kolom_join", how="cara_join")
# cara_join = inner, left, right, outer

df_order_detail_complete = df_order_detail.merge(df_product, how='inner', on='product_id')

In [37]:
# select used columns only
df_order_detail_complete.head()
df_order_detail_complete = df_order_detail_complete[['order_id', 'product_id', 'product_name', 'unit_price', 'quantity', 'discount']]

In [39]:
# checking seleted columns
df_order_detail_complete.head()

   order_id  product_id    product_name unit_price  quantity discount
0     10248          11  Queso Cabrales      21.00        12        0
1     10296          11  Queso Cabrales      21.00        12        0
2     10327          11  Queso Cabrales      21.00        50      0.2
3     10353          11  Queso Cabrales      21.00        12      0.2
4     10365          11  Queso Cabrales      21.00        24        0

In [45]:
# data enrichment process
# generate revenue = unit_price x quantity

df_order_detail_complete['revenue'] = df_order_detail_complete['unit_price'] * df_order_detail_complete['quantity']
df_order_detail_complete.head(20).sort_values(by='order_id')

,order_id,product_id,product_name,unit_price,quantity,discount,revenue
0,10248,11,Queso Cabrales,21.00,12,0,252.00
19,10248,42,Singaporean Hokkien Fried Mee,14.00,10,0,140.00
1,10296,11,Queso Cabrales,21.00,12,0,252.00
2,10327,11,Queso Cabrales,21.00,50,0.2,1050.00
3,10353,11,Queso Cabrales,21.00,12,0.2,252.00
4,10365,11,Queso Cabrales,21.00,24,0,504.00
5,10407,11,Queso Cabrales,21.00,30,0,630.00
6,10434,11,Queso Cabrales,21.00,6,0,126.00
7,10442,11,Queso Cabrales,21.00,30,0,630.00
8,10443,11,Queso Cabrales,21.00,6,0.2,126.00
9,10466,11,Queso Cabrales,21.00,10,0,210.00
10,10486,11,Queso Cabrales,21.00,5,0,105.00
11,10489,11,Queso Cabrales,21.00,15,0.25,315.00
12,10528,11,Queso Cabrales,21.00,3,0,63.00
13,10535,11,Queso Cabrales,21.00,50,0.1,1050.00
14,10542,11,Queso Cabrales,21.00,15,0.05,315.00
15,10545,11,Queso Cabrales,21.00,10,0,210.00
16,10553,11,Queso Cabrales,21.00,15,0,315.00
17,10566,11,Queso Cabrales,21.00,35,0.15,735.00
18,10570,11,Queso Cabrales,21.00,15,0.05,315.00

In [46]:
df_order_detail_complete['order_id'].value_counts()

order_id
10324    5
10382    5
10325    5
10465    5
10337    5
        ..
10478    1
10568    1
10320    1
10378    1
10585    1
Name: count, Length: 338, dtype: int64

table `order_details` masih memiliki duplicate di kolom order_id , gimana caranya untuk dapetin total revenue per order????

gunakan aggregasi `sum` untuk cari total revenue di 1 order

In [50]:
# total revenye per order
# template -> nama_var[['kol1', 'kol2']].groupby('kol_aggregasi').function()

agg = df_order_detail_complete[['order_id', 'revenue']].groupby('order_id').sum().reset_index()
agg.head()

   order_id  revenue
0     10248   566.00
1     10249  2329.25
2     10250  2267.25
3     10251   839.50
4     10252  4662.50

udah beres kah? belum fergusso, kita harus join hasil sum revenue per order ke table order

In [52]:
# join table order ke hasil aggregate revenue per order
mart_order = df_order.merge(agg, how = 'inner', on='order_id')
mart_order.head()

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country,revenue
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France,566.00
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany,2329.25
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil,2267.25
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France,839.50
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium,4662.50

In [53]:
# load mart to data mart_layer schema
mart_order.to_sql(
                    'mart_orders', 
                    con=engine,
                    schema='mart_layer',
                    if_exists='replace',
                    index=False,
                    method='multi'
                 )

338

In [ ]:
# datamart daily orders
# detail kolom 
# purchahse_date
# total_orders
# total_revenue
# total_quantity_sold

#### Exercise
1. Buat datamart untuk menyimpan summary order per customer dengan kolom
    - customer_id
    - full_name
    - total_orders
    - last_order_date (gausah dulu)
2. Simpan hasil pengolahan ke `datamart layer`